data = """
mb24-3,ЩМПг- 65.50.22 (ЩРНМ-3) IP54 EKF PROxima,1,"11 931,13","11 931,13"
mb-kar-a4,Карман для документации пластиковый А4 EKF,1,436.84,436.84
sn0-125-16-k,"Шина PEN ""ноль-земля"" (8x12мм) 16 отв. латунь крепеж по краям EKF",2,420.12,840.24
ak-1-1,"Изолятор угловой ""Стойка"" синий EKF",2,9.94,19.88
ak-1-1-y,"Изолятор угловой ""Стойка"" желтый EKF",2,9.94,19.88
an-1-01,"Наклейка ""Молния"" (100х100х100мм.) EKF PROxima",1,14.16,14.16
an-1-06,"Наклейка ""Земля"" (d30мм.) EKF PROxima",1,3.4,3.4
ahdw-211,Зажим на DIN-рейку 1 винт HDW-211 EKF PROxima,2,20.24,40.48
kk60-60,Канал кабельный перфорир. (ВхШ: 60х60мм.) EKF PROxima,1,633.98,633.98
kk60-40,Канал кабельный перфорир. (ВхШ: 60х40мм.) EKF PROxima,1,472.44,472.44
rkf-37,Реле контроля фаз RKF-37 EKF,1,"3 742,06","3 742,06"
mcb10-3-25C-av,AV-10 3P 25A (C) 10kA EKF AVERES,1,"2 860,63","2 860,63"
M636106B,Авт. выкл. 1P 6А (B) 6кА ВА 47-63N EKF PROxima,1,380.8,380.8
M636116B,Авт. выкл. 1P 16А (B) 6кА ВА 47-63N EKF PROxima,9,381.8,"3 436,20"
km-3-20-40,КМ 20А 4NО (3 мод.) EKF,5,"3 875,88","19 379,40"
ledm-ad16-g,Матрица светодиодная AD16-22HS зеленый 230 В AC EKF,5,138.78,693.9
ledm-ad16-r,Матрица светодиодная AD16-22HS красный 230 В AC EKF,5,139.48,697.4
xb2-bd21,Переключатель BD21 2P короткая ручка NO EKF,1,371.07,371.07
rp-25-3-230,РП 25/3 10А 230В АС EKF,4,629.83,"2 519,32"
rm-25-3,РМ 25/3 EKF,3,275.57,826.71
"""

lines = data.strip().split('\n')
result = []

for idx, line in enumerate(lines):
    parts = line.split(',')
    result.append({
        "id": idx + 1,
        "article": parts[0],
        "name": parts[1].strip('"'),
        "amount": float(parts[2]),
        "price": parts[3].strip('"'),
        "totalPrice": parts[4].strip('"')
    })

import json
print(json.dumps(result, ensure_ascii=False, indent=4))
